Tekla.Structures.ModelInternal.BuildingHierarchy.Building
Class for Building Hierarchy Building

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.contour
The contour.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.Description
Gets or sets the Description of the Building.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.BuildingHierarchy.Building class.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.BottomElevation
Gets or sets a building bottom z-level.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.TopElevation
Gets or sets a building top z-level.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.IsBuildingSection
Gets or sets a value indicating whether this building is a building section.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.Contour
Gets or sets the contour points for building.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.GetBuildings
Gets child buildings (building sections) belonging to this building.
Returns: All storeys belonging to this building.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.GetStoreys
Gets all storeys belonging to this building.
Returns: All storeys belonging to this building.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.GetSpaces
Gets all spaces belonging to this building.
Returns: All spaces belonging to this building.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.Insert
Inserts this Building Hierarchy object into model database. All the attributes must be set.
Returns: True if the object was successfully inserted.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.Select
Selects the Building Hierarchy object from model database. The object identifier must be set.
Returns: True if the object was successfully selected.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.Modify
Modifies the existing Building Hierarchy object in the model database to match the current one.
Returns: True if the object was successfully modified.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.Delete
Deletes the Building Hierarchy object instance with the given identifier from the model database.
Returns: True if the object was successfully deleted.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.GetSolid
Returns the solid of the pour object.
Returns: The solid of the pour object.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.GetBHType
